<template>
  <q-page class="container_bg">
    <div class="container q-pa-md">

      <q-card class="aside">
      <p class="aside_title">Пляжи Ялты</p>
      <q-separator size="3px" color="black" width="90%" class="q-mx-auto"/>
      <q-list>
        <q-item class="aside_item"
        v-for="(beach, index) in beaches"
          :key="index"
          clickable
          @click="scrollToBeach(index)"
        >
        <q-item-section>
            <q-item-label>{{ beach.name }}</q-item-label>
          </q-item-section>
        </q-item>
      </q-list>
    </q-card>

      <div class="q-pa-md row items-start q-gutter-md">
        <q-card
          class="my_card"
          flat
          bordered
          v-for="(beach, index) in beaches"
          :key="index"
          :id="'beach-' + index"
        >
          <q-img :src="beach.img" />
          <q-card-section>
            <div class="text-h5 q-mt-sm q-mb-xs indent text-bold">{{ beach.name }}</div>
            <div class="text-body1 indent text-justify">{{ beach.description }}</div>
            <q-space />
            <q-card-actions>
              <q-icon name="location_on" class="q-mr-sm" />
              <span>{{ beach.location }}</span>
            </q-card-actions>
            <q-card-actions>
              <q-icon name="directions"/>
              <span class="indent">{{ beach.howToGet }}</span>
            </q-card-actions>
          </q-card-section>
        </q-card>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  data() {
    return {
      beaches: [
        {
          name: 'Массандровский',
          img: 'Массандровский пляж.png',
          description: 'Пляж усыпан мелкой и галькой покрупнее. Он отличается чистотой пляжной зоны, за что награжден «Голубым флагом». Пользуется спросом среди отдыхающих. Вход бесплатный. На протяжении всей береговой линии установлены волнорезы, которые делят территорию пляжа на зоны. Имеются спасательные вышки, где внимательные спасатели следят за порядком на море. В пункте медицинской помощи помогут пострадавшим. На пляже имеются места для переодевания, уборные и душевые кабинки. Здесь можно взять в аренду шезлонги, солнцезащитные зонты. Широкий выбор различных развлечений на любой вкус.',
          location: 'ул. Дражинского, Ялта',
          howToGet: 'Добраться до пляжа легко от автобусной остановки «Вещевой рынок», где останавливаются автобусы № 109, 122, 132 и маршрутные такси № 21, 22, 44. После надо пройти 1-1,5 км пешком или воспользовавшись лестницей, в начале улицы им. Дражинского.'
        },
        {
          name: 'Дельфин',
          img: 'Пляж Дельфин.png',
          description: 'Длина пляжа около 300 м, а ширина 10 м. Береговая линия усеяна мелкой гладкой галькой. Когда море неспокойно, то волны закрывают узкое побережье полностью. Вход свободный. Туалет, раздевалки, навесы, душ предоставляются туристам бесплатно. На пляже следят за чистотой. Посетить солярий, бунгало и семейный уголок с игровым городком, надувными горками и лабиринтом, а также третий сектор и лаундж-террасу можно только за деньги. Туристов ждут на спортплощадках, на водных развлечениях, можно прокатиться на аквабайках, катамаранах, совершить морскую прогулку на катере. А кто не любит активный отдых, может посидеть в удобных шезлонгах под солнцезащитными зонтами, наслаждаясь морскими пейзажами. На пляже готовы прийти на помощь спасатели и медицинские работники. Пляж находится рядом с Ливадийским парком и дворцом. Вблизи с морем находятся пиццерии, кафе, бары.',
          location: 'Ливадия, Ялта',
          howToGet: 'Доехать можно на маршрутном такси (№ 9, 11, 15, 22, 35) до остановок «Санаторий «Россия», «Дом отдыха «Заря»» или «Таксопарк». Путь пешком от центра города вдоль набережной займет 30-40 минут.'
        },
        {
          name: 'Приморский',
          img: 'приморский пляж.png',
          description: 'Пляж «Приморский» занимает площадь до 400 метров. Вход на пляж бесплатный, заплатить придется только за использование дополнительных услуг. Покрытие прибрежной зоны – мелкая галька, поэтому ходить без обуви достаточно комфортно. Глубина в море увеличивается постепенно, вход пологий.За дополнительную плату посетители пляжа могут взять напрокат пляжное оборудование, воспользоваться раздевалками, уборными и душевыми. Для маленьких гостей на пляже предусмотрены водные горки и детские надувные комплексы для купания. Гости постарше предпочитают арендовать катамараны, аквабайки или отправляться на дайвинг. На территории пляжа семьи могут перекусить в местных пиццериях, кафетериях и барах.Также в хорошую погоду по вечерам проводятся различные шоу, концерты и выступления.',
          location:'Приморский парк',
          howToGet: 'До Приморского пляжа легко добраться на любом автобусе или маршрутном такси, идущем в центр Ялты.'
        },
        {
          name: 'Никитский',
          img: 'Никитский пляж.png',
          description: 'Берег покрыт галькой и растянулся на 250 м, пирсы делят его на отдельные зоны. Некоторые относятся гостиницам, поэтому попасть туда можно только за плату. Остальное побережье является доступным для всех, вход бесплатный. Спуск неглубокий, но дно каменистое, поэтому заходить в море надо аккуратно. В пунктах проката представлено много пляжного инвентаря, имеются кабинки для переодевания, уборные. На пляже бойкая торговля напитками, мороженым, сладостями, легкими закусками. На платных зонах пляжа туристам предложат более комфортные условия отдыха и водные развлечения. Народу здесь меньше, чем на главных пляжах Ялты, цены на услуги доступные. Здесь можно заказать морскую прогулку до Гурзуфа. Поблизости находится Никитский ботанический сад с уникальной редкой флорой и незабываемыми ароматами хвои и запахом благоухающих цветов.',
          location: 'пгт Никита, Ялта',
          howToGet: 'Из Ялты до поселка Никита ходят автобусы № 29 и 29А. Также до поселка можно добраться на катере из Ялты. Путь на машине пролегает через Массандру и Отрадное, есть платная стоянка.'
        },
        {
          name: 'Пляж Yalta Intourist',
          img: 'Интурист пляж.png',
          description: 'Протяженность береговой полосы достигает в длину 450 м и имеет три уровня. Легче всего спуститься по канатной дороге от гостиницы, самостоятельно попасть сюда можно по крутой тропе. Береговая линия усыпана галькой крупного и среднего размера. Пляж платный и хорошо оборудован. Удобство и комфорт отдыхающим обеспечат установленные навесы и зонтики, создающие тень и спасая от солнца. К услугам туристов прокат инвентаря, кабинки для переодевания, уборные и душевые кабины. Центр водных развлечений организует водные развлечения, здесь можно прокатиться на аквабайках, катамаранах, совершить морскую прогулку на катере. Полетать на дельтаплане. Торговые палатки и магазины предлагают туристам все необходимое, а многочисленные кафе и бары угостят напитками и десертами на любой вкус.',
          location: 'ул. Дражинского, Ялта',
          howToGet: 'Доехать до пляжа удобно на 34-м автобусе, от остановки «Дельфинарий» пройти до канатной дороги (станция «Шоссе туристов»).'
        },
      ]
    };
  },
  methods: {
    scrollToBeach(index) {
      const element = document.getElementById('beach-' + index);
      if (element) {
        element.scrollIntoView({ behavior: 'smooth' });
      }
    }
  }
};
</script>
<style scoped>
.my_card{
  border-radius: 10px;
}
</style>