<template>
  <div class="container_bg">
    <div class="container q-py-md">
      <div class="q-gutter-md paralax_box">
        <div class="row justify-between">
          <q-parallax class="paralax_img" src="\Ялта_Паралакс.png" height="500">
            <h1 class="text-white">Как все начиналось?</h1>
          </q-parallax>
        </div>
      </div>

      <q-card class="my-card" flat bordered>
        <q-card-section horizontal>
          <q-card-section class="text-justify indent">
            <q-card-section>
              Предпологают, что название города происходит от греческого слова
              «Ялос», что означает «берег, прибрежная». Старинная греческая
              легенда рассказывает: «…много веков назад отправились греки на
              поиски новых земель, Неласково встретило их Черное море, штормами
              и туманами. Много дней блуждали моряки, не ведая, куда плывут, на
              корабле закончилась пресная вода и пища. Моряки пали духом и
              покорно ждали гибели. Но однажды утром рассеялся туман, и люди
              увидели долгожданный берег и зелено-лиловые горы.
            </q-card-section>
            <q-card-section>
              Так гласит легенда. Однако археологам пока не удалось обнаружить
              следов греческого поселения, относящегося к античности. И слова
              «ялос» в древнегреческом языке не существовало, оно появилось в
              более позднее время. Есть свидетельства и более раннего обитания
              людей в этом месте. Кремневые орудия неолитического времени
              найдены при городских раскопках, как и памятники эпохи бронзы -
              времени 11-1 тысячелетий до нашей эры.
            </q-card-section>
          </q-card-section>
          <q-img class="col-5" src="\Ялта1.png" />
        </q-card-section>
      </q-card>
      <q-card class="my-card" flat bordered>
        <q-card-section horizontal>
          <q-img class="col-5" src="\Ялта2.png" />
          <q-card-section class="text-justify indent">
            <q-card-section>
              Древнейшими обитателями Ялтинской долины были тавры. На
              Поликуровском холме и на окраинах города археологи нашли каменные
              ящики, в которых они хоронили своих умерших, святилища, остатки
              поселений, относящихся к VI-V векам до н.э.
            </q-card-section>
            <q-card-section>
              Первое письменное упоминание о Ялте оставил арабский географ и
              путешественник XII века Аль-Идриси. В 1154 году вышел его труд
              «Развлечение тоскующего о странствии по области». В котором он,
              описывая крымское побережье, называет здешний городок Джалитой. Во
              второй половине XIII века на Южнобережье появились венецианские
              купцы, но их очень скоро вытеснили генуэзцы, которые по всему
              побережью основали торговые фактории и построили укрепления. На
              генуэзских картах и в документах Ялта упоминалась под именами
              Ялита, Гиалита, Эталита . В 1475 году хозяевами Южного берега
              Крыма стали турки. Ялта входила в провинцию, находившуюся в личном
              владении турецкого султана.
            </q-card-section>
          </q-card-section>
        </q-card-section>
      </q-card>
      <q-card class="my-card" flat bordered>
        <q-card-section horizontal>
          <q-img src="\Ялта4.png" height="500px" />
        </q-card-section>
      </q-card>
      <q-card class="my-card text-justify indent" flat bordered>
        <q-card-section horizontal>
          <q-card-section class="q-mr-md">
            17 сентября 1838 года, прибывший на освящение нового храма Император
            Николай I обнародовал указ об образовании Ялтинского уезда и
            переименовании местечка Ялты в город, а 23 марта 1838 г. сенат издал
            указ, который гласил: «Приняв во внимание особенное местное
            положение южного берега полуострова Таврического, быстрое
            возрастание там населения и приметное между жителями распространение
            промышленности, признали мы за благо, для устранения неудобств,
            происходящих от накопления дел в присутственных местах уезда
            Симферопольского учредить в Таврической губернии новый уезд… из
            части нынешнего Симферопольского уезда… составить новый уезд под
            названием Ялтинского, переименовав местечко Ялты городом…».
          </q-card-section>

          <q-separator class="q-mr-sm" vertical />

          <q-card-section>
            Во время Крымской войны 1854-1855 гг., Ялта была разграблена
            англо-французским десантом. После окончания войны восстановление
            города происходило крайне медленно, чему способствовало тяжелое
            экономическое состояние Российской империи в целом. По списку 1864
            года в Ялте находилось 53 дома с населением в 1112 человек и были
            три улицы (добавилась Почтовая). Порта тоже не было. Пароходы
            становились на рейде, баркасы связывали их с берегом.
          </q-card-section>
        </q-card-section>
      </q-card>
      <q-card class="my-card" flat bordered>
        <q-card-section horizontal>
          <q-card-section class="text-justify indent">
            <q-card-section>
              Ситуация резко изменилась с 1866 года, когда по совету профессора
              СП. Боткина, первым оценившего выдающиеся климатические
              особенности места, близ Ялты, в Ливадии, стала отдыхать в осенние
              месяцы императрица Мария Александровна. В 70-е годы XIX века в
              городе началось бурное строительство. Этому способствовало то
              обстоятельство, что царская семья приобрела соседнюю Ливадию. В
              1873 году было, наконец, завершено строительство железной дороги,
              связавшей Крым с обеими столицами империи. После того, как Ливадия
              стала царской резиденцией, Ялта довольно быстро превратилась в
              популярный аристократический курорт, своеобразную крымскую
              Ривьеру. Вслед за титулованными особами в Крым устремились
              разбогатевшие фабриканты и купцы. Ялта становится модным курортом
              с фешенебельными гостиницами, магазинами, ресторанами, лечебницами
              и дачами.
            </q-card-section>
            <q-card-section>
              Публика собиралась здесь богатая, в начале осени, когда спадала
              летняя жара, дамы щеголяли в бархатных нарядах – так появился
              «бархатный сезон».
            </q-card-section>
          </q-card-section>
          <q-img class="col-5" src="\Ялта5.png" />
        </q-card-section>
      </q-card>
      <q-card class="my-card" flat bordered>
        <q-card-section horizontal>
          <q-img class="col-5" src="\Чехов.png" />
          <q-card-section class="text-justify indent">
            <q-card-section>
              Ялте прошли последние пять лет жизни А.П.Чехова. Чахотка не
              позволяла ему жить в сыром и холодном климате. В Аутке он в 1899
              году по проекту архитектора Л.Н.Шаповалова построил двухэтажный
              дом с мезонином, который назвали “Белой дачей» (ул. Кирова, 112).
              Здесь бывали великий русский художник И.Левитан, писатель Бунин, в
              полном составе приезжала труппа Московского художественного театра
              во главе со Станиславским и В.Немировичем-Данченко. В Ялте Чехов
              написал девять рассказов и две пьесы: « Три сестры» и «Вишневый
              сад». С городом - курортом связаны многие годы жизни (с 1879 по
              1913 гг.) выдающейся украинской поэтессы Леси Украинки
              (Л.П.Косач), страдающей тяжелым недугом – костным ревматизмом.
              Будучи тяжело больной, она не только лечилась здесь, но и
              продолжала работать. Первым городским врачом Ялты был
              замечательный украинский поэт Степан Руданский (1833-1873), автор
              широко известной песни “Повiй, вiтре, на Вкраiну...”, ставшей
              народной, и многих других поэтических произведений. Он известен и
              как переводчик поэзии с древнегреческого и русского языков на
              украинский. В разные годы в Ялту приезжали на отдых и лечение
              Л.Н.Толстой, В.Г.Короленко, А.И.Куприн, С.В.Рахманинов,
              И.И.Левитан, М.С.Щепкин, И.С.Козловский, Б.Р.Гмыря, Г.И.Майборода,
              С.Я.Маршак, А.Т.Твардовский, О.А.Гончар, А.М Горький и многие
              другие видные писатели, художники, музыканты, ученые, политические
              и государственные деятели. В городском театре пели Ф.И.Шаляпин и
              Л.В.Собинов. Впрочем, легче, пожалуй, перечислить имена тех
              знаменитостей, кто не отдыхал на приветливом Южнобережье.
            </q-card-section>
          </q-card-section>
        </q-card-section>
      </q-card>
      <q-card class="my-card text-justify indent" flat bordered>
        <q-card-section horizontal>
          <q-card-section class="q-mr-md">
            Период революции и Гражданской войны обеспечил Ялте «мировую
            известность» благодаря массовому уничтожению большевиками десятков
            тысяч безвинных людей и переименование её в город Красноармейск.
            Мотивировалось это тем, что, во-первых, Ялта оказалась конечным
            пунктом наступления Красной Армии в 1920 году на юг, и, во-вторых, с
            названием Ялта связывалось представление о городе-курорте,
            являвшемся прежде центром разврата и разгула кутящей буржуазии.
            <q-card-section>
              Хотя новое название города продержалось всего полгода, а уже в
              августе 1921 года было возвращено прежнее, историческое, - радости
              это не прибавило никому: Ялта, как и Крым, погибала от голода.
           
            </q-card-section>
          </q-card-section>

          <q-separator class="q-mr-sm" vertical />

          <q-card-section>
            В начале Великой Отечественной войны в санаториях Ялты разместились
            госпитали, через Ялтинский порт шла эвакуация жителей Одессы,
            Николаева и Херсона в порты Кавказского побережья. Еще до освобождения Ялты
            партизаны остановили подрывные работы, не позволив уничтожить
            великолепные дворцы, заминированные фашистами. Ялту освободили 16
            апреля 1944 года. С 4 по 11 февраля 1945 года в Ялте в Ливадийском
            дворце была проведена конференция глав трех держав антигитлеровской
            коалиции СССР (Иосиф Сталин), Великобритании (Уинстон Черчилль) и
            США (Франклин Рузвельт), на которой обсуждались вопросы
            окончательного разгрома фашисткой Германии, послевоенного устройства
            мира и деятельности Организации Объединенных Наций (ООН).
            <q-card-section>
              Организация Объединенных Наций, основанная по решению Ялтинской
              конференции, создала условия для развития современного
              Международного права. Это была вторая из трех встреч глав
              государств антигитлероской коалиции. Созданный в Ялте биполярный
              мир и жёсткий раздел Европы на восток и запад сохранились более
              чем на 40 лет, до конца 1980-х годов.
            </q-card-section>
          </q-card-section>
        </q-card-section>
      </q-card>
      <q-card class="my-card" flat bordered>
        <q-card-section horizontal class="flex column yalta6">
          <q-img src="\Ялта6.png" height="500px" />
          <q-card-section class="indent">
              Современная Ялта - огромная курортная структура, в состав которой входит территория Алупкинского горсовета, а также семь поселковых советов. Массандра, Никита, Гаспра, Ливадия, Мисхор, Кореиз, Симеиз - это знаменитые названия выдающихся курортных мест Южного берега Крыма, и все они части Большой Ялты, и каждое из них заслуживает хотя бы экскурсионного осмотра. Находясь в Ялте, категорически нельзя не посетить Алупкинский, Ливадийский и Массандровский дворцы-музеи, не побывать в знаменитом Никитском ботаническом саду или на мысе Ай-Тодор, как нельзя не исходить город вдоль и поперек, постигая его архитектурные, ландшафтные и флористические достопримечательности.
          </q-card-section>
        </q-card-section>
      </q-card>
      
    </div>
  </div>
</template>

<script setup>
defineOptions({
  name: "HistoryPage",
});
</script>

<style scoped>
.my-card {
  border-radius: 14px;
  padding: 7px;
  font-size: 18px;
  margin-bottom: 10px;
}
.q-card__section--vert {
  padding: 7px;
}
.paralax_box,
.paralax_img {
  border-radius: 10px;
}
.yalta6{
    border-radius: 14px;
}
</style>
